export const getHomeInterviews = async () => {
    const data = [
        {
            id: 1,
            title: "حوار مع مسرحی",
            excerpt: "",
            cover: "./images/hemdi.jpeg",
            with: {
                image: "/images/hemdi.jpeg",
                name_ar: "حمدي عزازي"
            }

        },
        {
            id: 2,
            title: "حوار مع سينيمائي",
            excerpt: "",
            cover: "/images/robert.jpeg",
            with: {
                image: "https://classes.stellaadler.com/wp-content/uploads/sites/6/2024/05/10-1.jpg",
                name_ar: "روبرت دي نيرو"
            }

        },
        {
            id: 3,
            title: "حوار مع سينيمائي",
            excerpt: "",
            cover: "/images/robert.jpeg",
            with: {
                image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTfbD4lM_99y4LXcDYTJewsq33aETDaDTZ-UZO0u9c039dzV4flJcUQCk3rYI0a3vFr14QYU9kCODtsVLOKKMMJRmndcdvyEQUIGoRO_qM&s=10",
                name_ar: "روبرت دي نيرو"
            }

        },
        {
            id: 4,
            title: "حوار مع سينيمائي",
            excerpt: "",
            cover: "/images/martin.jpeg",
            with: {
                image: "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMjNcLzA1XC8xNTUxODkuanBnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjo1NTYsImhlaWdodCI6NjgwLCJmaXQiOiJjb3ZlciJ9fX0=",
                name_ar: "مارتن سكورسيزي"
            }

        },
    ]
    return data
}

export const getInterviewBySlug = async (slug: string) => {
    const data = {
        id: 1,
        title: "حوار مع حمدي عزازي - مدرسة المسرح وقيم العطاء",
        cover: "/images/hemdi.jpeg",
        with: {
            image: "/images/hemdi.jpeg",
            name_ar: "حمدي عزازي",
            about: `
                في زمن تكتسح فيه الخوارزميات مخيلة األجيال الصاعدة، ويتحول فيه التعليم
أحيانا إلى ً
"جدران صامتة" ، يبرز الفنان حمدي عزازي كمنارة تكسر هذا الحصار بـ "ريشة"
المسرح.
ابن الدار البيضاء الذي صقلته سنوات من البذل و العطاء، اختار أن يكون مبدعا يزاوج
بين صرامة التأطير البيداغوجي وعفوية اللعب الدرامي.
"مؤسسة التفتح للتربية والتكوين ببرشيد"، حيث ال يقتصر
اليوم، يتجلى إشعاعه في
دوره على التلقين التقني، بل يمتد ليزرع قيم اإلنسانية الرفيعة في نفوس الناشئة،
مجسداً
" الذي يترك
نموذج "الفنان المربي
أثرا ال يمحى في كل من جايله
`
        },
        lines: [
            {
                type: "question",
                content: `من خالل تجربتك، كيف تنجح في تحويل 'ساحة المدرسة' أو 'الفصل الدراسي' إلى فضاء فني؟ وهل يتقبل التالميذ
                    فكرة التمثيل بسهولة في محيطهم التعليمي؟`
            },
            {
                type: "answer",
                content: `
                    لقد انطلق ُت في رحلتي من فصول تدريس اللغة اإلنجليزية، حيث أدرك ُت
                    مبكرا أن الحصة الدراسية الجامدة ما هي إال ً
                    جدار صامت يورث التلميذ شتات الذهن ورتابة الروح. ومن هنا، ق ُ ررت كسر هذا الحصار عبر استحضار 'روح
                    المسرح' إلى قلب العملية التعليمية؛ فلم تكن الحوارات اللغوية بالنسبة لي مجرد تمارين جافة، بل كانت
                    'بذورا لمشاهد ً
                    مسرحية' نابضة بالحياة.
                    أما عن التقبل، فالسر يكمن في تحويل التمثيل إلى 'لعبة فنية' ممتعة تالمس شغف التلميذ؛ فمتى ما شعر أن المسرح
                    مساحة للحرية والمرح ال مادة للضغط، انخرط فيه بقلبه، لتتحول ساحة المدرسة من فضاء تعليمي نمطي إلى رحاب
                    لإلبداع
                    `
            },
            {
                type: "question",
                content: `من خالل تجربتك، كيف تنجح في تحويل 'ساحة المدرسة' أو 'الفصل الدراسي' إلى فضاء فني؟ وهل يتقبل التالميذ
                    فكرة التمثيل بسهولة في محيطهم التعليمي؟`
            },
            {
                type: "answer",
                content: `
                    لقد انطلق ُت في رحلتي من فصول تدريس اللغة اإلنجليزية، حيث أدرك ُت
                    مبكرا أن الحصة الدراسية الجامدة ما هي إال ً
                    جدار صامت يورث التلميذ شتات الذهن ورتابة الروح. ومن هنا، ق ُ ررت كسر هذا الحصار عبر استحضار 'روح
                    المسرح' إلى قلب العملية التعليمية؛ فلم تكن الحوارات اللغوية بالنسبة لي مجرد تمارين جافة، بل كانت
                    'بذورا لمشاهد ً
                    مسرحية' نابضة بالحياة.
                    أما عن التقبل، فالسر يكمن في تحويل التمثيل إلى 'لعبة فنية' ممتعة تالمس شغف التلميذ؛ فمتى ما شعر أن المسرح
                    مساحة للحرية والمرح ال مادة للضغط، انخرط فيه بقلبه، لتتحول ساحة المدرسة من فضاء تعليمي نمطي إلى رحاب
                    لإلبداع
                    `
            },
            {
                type: "question",
                content: `من خالل تجربتك، كيف تنجح في تحويل 'ساحة المدرسة' أو 'الفصل الدراسي' إلى فضاء فني؟ وهل يتقبل التالميذ
                    فكرة التمثيل بسهولة في محيطهم التعليمي؟`
            },
            {
                type: "answer",
                content: `
                    لقد انطلق ُت في رحلتي من فصول تدريس اللغة اإلنجليزية، حيث أدرك ُت
                    مبكرا أن الحصة الدراسية الجامدة ما هي إال ً
                    جدار صامت يورث التلميذ شتات الذهن ورتابة الروح. ومن هنا، ق ُ ررت كسر هذا الحصار عبر استحضار 'روح
                    المسرح' إلى قلب العملية التعليمية؛ فلم تكن الحوارات اللغوية بالنسبة لي مجرد تمارين جافة، بل كانت
                    'بذورا لمشاهد ً
                    مسرحية' نابضة بالحياة.
                    أما عن التقبل، فالسر يكمن في تحويل التمثيل إلى 'لعبة فنية' ممتعة تالمس شغف التلميذ؛ فمتى ما شعر أن المسرح
                    مساحة للحرية والمرح ال مادة للضغط، انخرط فيه بقلبه، لتتحول ساحة المدرسة من فضاء تعليمي نمطي إلى رحاب
                    لإلبداع
                    `
            },
        ],
        date: new Date("2026-03-30").toLocaleDateString('ar', {
        day: 'numeric',
        month: 'long',
        year: 'numeric'
      }),
        category: "مسرح"

    }
    return data
}